_Rarzrabotki/Kazna/InformationRegisters/ОтметкиРегистрацииНН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ОтметкиРегистрацииНН</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/InformationRegisters/ОтметкиРегистрацииНН/Ext/ManagerModule.bsl
Функция ННЗарегистирована(ДокументОснование) Экспорт
	Запрос = новый Запрос;
	Запрос.Текст=  "ВЫБРАТЬ
	               |	ОтправкаПолучениеДокументов.ДокументОснование
	               |ИЗ
	               |	РегистрСведений.ОтметкиРегистрацииНН КАК ОтправкаПолучениеДокументов
	               |ГДЕ
	               |	ОтправкаПолучениеДокументов.ДокументОснование = &ДокументОснование
	               |	И ОтправкаПолучениеДокументов.ДатаРегистрации <> ДатаВремя(1,1,1)";
	ЗАпрос.УстановитьПараметр("ДокументОснование",ДокументОснование);
	Возврат НЕ Запрос.Выполнить().Пустой();
КонецФункции // ()
